InformationRegisters/ЛБ_СоглашенияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СоглашенияЭДО</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыСоглашенийЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыСоглашенийЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыСоглашенийЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторгнуто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗаключено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЛБ_СоглашенияЭДОКлиент/Ext/Module.bsl
Процедура ОбработкаКоманд(ИмяКоманды = "", Клиент = Неопределено, ОписаниеОповещения = Неопределено, ПараметрыОтчетаОбЭДО = Неопределено, Форма = Неопределено) Экспорт
	Если ИмяКоманды = "ЗаключитьЭДО" Тогда
		ДействующееСоглашение = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Клиент);
		Если ДействующееСоглашение = Ложь Тогда
			ЗаключитьЭДОКлиент(Клиент, Форма);
		Иначе
			Вопрос("У клиента уже есть действующее ЭДО.",
			РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
		КонецЕсли;
	ИначеЕсли ИмяКоманды = "РасторгнутьЭДОКлиент" Тогда
		ДействующееСоглашение = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Клиент);
		Если ДействующееСоглашение = Истина Тогда
			Параметры = Новый Структура("Клиент", Клиент);
			
			ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаРасторженияЭДОКлиент", Параметры
			,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			Вопрос("У клиента нет действующего ЭДО.",
			РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
		КонецЕсли;
	ИначеЕсли ИмяКоманды = "РасторгнутьЭДОКлиентПродолжить" Тогда
		РасторгнутьЭДОКлиент(Клиент, Форма, ОписаниеОповещения);
	ИначеЕсли ИмяКоманды = "РасторгнутьЭДО_ЦО" Тогда
		ДействующееСоглашение = ЛБ_СоглашенияЭДОСервер.НаличиеДействующегоСоглашения(Клиент);
		Если ДействующееСоглашение = Истина Тогда
			РасторгнутьЭДО_ЦО(Клиент);
		Иначе
			Вопрос("У клиента нет действующего ЭДО.",
			РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
		КонецЕсли;
	ИначеЕсли ИмяКоманды = "УдалитьЭДО" Тогда
			УдалитьЭДО(Клиент);
	ИначеЕсли ИмяКоманды = "ИсторияЭДО" Тогда
		ОткрытьФорму("РегистрСведений.ЛБ_СоглашенияЭДО.Форма.ФормаНабораЗаписей", 
		Новый Структура("Клиент", Клиент),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	ИначеЕсли ИмяКоманды = "ПечатьСогласиеОбЭДО" Тогда
		ПечатьСоглашенияИзФормы(Клиент, Форма);
	ИначеЕсли ИмяКоманды = "ПечатьРасторженияЭДО" Тогда
		ПечатьРасторженияИзФормы(Клиент, Форма);
	ИначеЕсли ИмяКоманды = "ПечатьОтчетОбЭДО" Тогда
		ПечатьОтчетОбЭДО(ПараметрыОтчетаОбЭДО, Форма);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаключитьЭДОКлиент(Клиент, Форма)
	
	ОтветПечатьСоглашения = Вопрос("Распечатать Соглашение об ЭДО?",
	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	
	Если ОтветПечатьСоглашения = КодВозвратаДиалога.Да Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Клиент", Клиент);
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ОписаниеОповещенияПечатьСоглашения = Новый ОписаниеОповещения("ПечатьСоглашенияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПечатьСоглашения(Клиент, Форма, ОписаниеОповещенияПечатьСоглашения);	
	КонецЕсли;
	
КонецПроцедуры // ЗаключитьЭДОКлиент()

Процедура РасторгнутьЭДОКлиент(Клиент, Форма, ОписаниеОповещения) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Клиент", Клиент);
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ПечатьРасторжения(Клиент, Форма, ОписаниеОповещения);
КонецПроцедуры

Процедура РасторгнутьЭДО_ЦО(Клиент) 
	ОтветРасторжениеПодписано = Вопрос("Фиксируется факт расторжения Соглашения об ЭДО по инициативе компании?",
	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	
	Если ОтветРасторжениеПодписано = КодВозвратаДиалога.Да Тогда
		ЛБ_СоглашенияЭДОСервер.РасторгнутьЭДО_ЦОСервер(Клиент);
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьЭДО(Клиент)
	СтруктураЭДО = ЛБ_СоглашенияЭДОСервер.ПоследнийСтатусЭДО(Клиент);
	Если СтруктураЭДО.Количество() > 0 Тогда
	Если СтруктураЭДО.Статус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыСоглашенийЭДО.Заключено") Тогда
		ОтветУдалить = Вопрос("Удалить ошибочное ЭДО?",
		РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
		
		Если ОтветУдалить = КодВозвратаДиалога.Да Тогда
			Если Не ЛБ_СоглашенияЭДОСервер.ПроверкаРоли_ЛБ_СотрудникЦО() Тогда 
				Если (СтруктураЭДО.Период + 3600) > ТекущаяДата() Тогда
					Если СтруктураЭДО.Ответственный = ЛБ_СоглашенияЭДОСервер.ТекущийСотрудникСеанса() Тогда
						ЛБ_СоглашенияЭДОСервер.УдалитьЗаключениеЭДОСервер(Клиент, СтруктураЭДО);
						//++ИвановВВ 12.2025, согласия на обработку ПД
						//временно отключил до полной реализации
						СтруктураСогласияПД = ЛБ_СогласияНаОбработкуПД_Сервер.НаличиеДействующегоСогласия(Клиент);
						Если СтруктураСогласияПД.Результат = Истина Тогда
							ЛБ_СогласияНаОбработкуПД_Сервер.УдалитьСогласиеНаОбработкуПД(Клиент, СтруктураСогласияПД.Период);
						КонецЕсли;
						//--ИвановВВ
					Иначе
						Вопрос("Соглашение было заключено другим пользователем, удаление запрещено.",
						РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
					КонецЕсли;
				Иначе
					Вопрос("С момента заключения соглашения прошло более 1 часа, удаление запрещено.",
					РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
				КонецЕсли;
			Иначе	
				ЛБ_СоглашенияЭДОСервер.УдалитьЗаключениеЭДОСервер(Клиент, СтруктураЭДО);
				//++ИвановВВ 12.2025, согласия на обработку ПД
				//временно отключил до полной реализации
				СтруктураСогласияПД = ЛБ_СогласияНаОбработкуПД_Сервер.НаличиеДействующегоСогласия(Клиент);
				Если СтруктураСогласияПД.Результат = Истина Тогда
					ЛБ_СогласияНаОбработкуПД_Сервер.УдалитьСогласиеНаОбработкуПД(Клиент, СтруктураСогласияПД.Период);
				КонецЕсли;
				//--ИвановВВ
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли СтруктураЭДО.Статус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыСоглашенийЭДО.Расторгнуто") Тогда
		ОтветУдалить = Вопрос("Удалить ошибочное расторжение ЭДО?",
		РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
		
		Если ОтветУдалить = КодВозвратаДиалога.Да Тогда
			Если Не ЛБ_СоглашенияЭДОСервер.ПроверкаРоли_ЛБ_СотрудникЦО() Тогда 
				Если (СтруктураЭДО.Период + 3600) > ТекущаяДата() Тогда
					Если СтруктураЭДО.Ответственный = ЛБ_СоглашенияЭДОСервер.ТекущийСотрудникСеанса() Тогда
						ЛБ_СоглашенияЭДОСервер.УдалитьРасторжениеЭДОСервер(Клиент, СтруктураЭДО);
					Иначе
						Вопрос("Соглашение было заключено другим пользователем, удаление запрещено.",
						РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
					КонецЕсли;
				Иначе
					Вопрос("С момента заключения соглашения прошло более 1 часа, удаление запрещено.",
					РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
				КонецЕсли;
			Иначе	
				ЛБ_СоглашенияЭДОСервер.УдалитьРасторжениеЭДОСервер(Клиент, СтруктураЭДО);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	Иначе
		Вопрос("У клиента нет действующего ЭДО.",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК); 
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьСоглашения(Клиент, Форма, ОписаниеОповещенияПечатьСоглашения)
	ТабличныйДокумент = ЛБ_СоглашенияЭДОСервер.ПечатьСоглашениеОбЭДОСервер(Клиент);
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_СоглашениеОбЭДО");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Соглашение об электронном взаимодействии"; 
	КоллекцияПечатныхФорм[0].Экземпляров = 2;
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Форма, ОписаниеОповещенияПечатьСоглашения);
КонецПроцедуры // ПечатьСоглашения()

Процедура ПечатьРасторжения(Клиент, Форма, ОписаниеОповещенияПечатьСоглашения)
	ТабличныйДокумент = ЛБ_СоглашенияЭДОСервер.ПечатьРасторжениеЭДОСервер(Клиент);
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_РасторжениеЭДО");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Заявление о расторжении соглашения об электронном взаимодействии";
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Форма, ОписаниеОповещенияПечатьСоглашения);
КонецПроцедуры // ПечатьСоглашения()

Процедура ПечатьСоглашенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ОтветСоглашениеПодписано = Вопрос("Соглашение об ЭДО подписано клиентом?",
	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	Если ОтветСоглашениеПодписано = КодВозвратаДиалога.Да Тогда
		ПериодЗаключения = ТекущаяДата();
		РезультатЗаключенияЭДО = ЛБ_СоглашенияЭДОСервер.ЗаключитьЭДОСервер(ДополнительныеПараметры.Клиент, ПериодЗаключения);
		Если РезультатЗаключенияЭДО Тогда
			//++ИвановВВ 12.2025, дополнение согласиями на обработку ПД
			//было:
			//Вопрос("Факт заключения ЭДО зафиксирован.",
			//РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
			//ДополнительныеПараметры.Форма.Элементы.СтатусЭДО.Заголовок = "есть";
			//стало:
			ОтветФактЗаключенияЭДО = Вопрос("Факт заключения ЭДО зафиксирован.",
			РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
			ДополнительныеПараметры.Форма.Элементы.СтатусЭДО.Заголовок = "есть";
			//временно отключил до полной реализации
			Если ОтветФактЗаключенияЭДО = КодВозвратаДиалога.ОК Тогда
				Вопрос("Печатаем Согласие на обработку персональных данных.", РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
				ЛБ_СогласияНаОбработкуПД_Сервер.ЗаключитьСогласиеНаОбработкуПД(ДополнительныеПараметры.Клиент, ПериодЗаключения + 1);
				ТабличныйДокументПД = ЛБ_СогласияНаОбработкуПД_Сервер.ПечатьСогласиеНаОбработкуПД(ДополнительныеПараметры.Клиент);
				КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_СогласиеПД");    
				КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокументПД; 
				КоллекцияПечатныхФорм[0].СинонимМакета = "Согласие на обработку ПД";
				УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено);
			КонецЕсли;
			//--ИвановВВ
		КонецЕсли;
	Иначе 
		Вопрос("Соглашение об ЭДО не заключено.",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);	
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьРасторженияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ОтветРасторжениеПодписано = Вопрос("Заявление о расторжении ЭДО подписано клиентом?",
	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	Если ОтветРасторжениеПодписано = КодВозвратаДиалога.Да Тогда
		РезультатРасторженияЭДО = ЛБ_СоглашенияЭДОСервер.РасторгнутьЭДОСервер(ДополнительныеПараметры.Клиент);
		Если РезультатРасторженияЭДО Тогда
			
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьСоглашенияИзФормы(Клиент, Форма)
	Соглашение = ЛБ_СоглашенияЭДОСервер.НаличиеСоглашения(Клиент);
	Если Соглашение = Истина Тогда	
    ТабличныйДокумент = ЛБ_СоглашенияЭДОСервер.ПечатьСоглашениеОбЭДОСервер(Клиент, Истина);
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_СоглашениеОбЭДО");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Соглашение об электронном взаимодействии";
	КоллекцияПечатныхФорм[0].Экземпляров = 2;
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,Форма);
	Иначе
		Вопрос("Клиент не заключал ЭДО.",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьРасторженияИзФормы(Клиент, Форма)
	Расторжение = ЛБ_СоглашенияЭДОСервер.НаличиеРасторжения(Клиент);
	Если Расторжение = Истина Тогда	
    ТабличныйДокумент = ЛБ_СоглашенияЭДОСервер.ПечатьРасторжениеЭДОСервер(Клиент, Истина);
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_РасторжениеЭДО");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Заявление о расторжении соглашения об электронном взаимодействии";
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Форма);
	Иначе
		Вопрос("У клиента нет растоженного соглашения ЭДО.",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьОтчетОбЭДО(ПараметрыОтчетаОбЭДО, Форма)
	ТабличныйДокумент = ЛБ_СоглашенияЭДОСервер.ПечатьОтчетОбЭДОСервер(ПараметрыОтчетаОбЭДО);
	Если ТабличныйДокумент = Неопределено Тогда
		Предупреждение("Нет данных за выбранный период");
		Возврат;
	Иначе 
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтчетОбЭДО");    
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о заключенных / расторгнутых соглашениях об электронном взаимодействии, полученных заявлениях об изменении контактных данных";  // используется для формирования имени файла при сохранении из общей формы печати документов
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,Форма);
	КонецЕсли;
КонецПроцедуры
